explor/app/controllers/places_controller.rb

  def index
    @locations = @current_user.locations.all
---
SELECT "locations".* FROM "locations" INNER JOIN "locations_users" ON "locations"."id" = "locations_users"."location_id" WHERE "locations_users"."user_id" = $1  [["user_id", 5]]

  def create
  	@current_user.locations.find_or_create_by location_params # works
  	@location = Location.find_by location_params
  	puts @location
  	@current_user.favorites << @location.favorites.create(place_params) # works
---
INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Seattle, WA, USA"], ["created_at", "2015-11-24 00:43:25.474474"], ["updated_at", "2015-11-24 00:43:25.474474"]]
INSERT INTO "favorites" ("categories", "title", "img", "vicinity", "place_id", "price_level", "rating", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"