app/controllers/places_controller.rb

SELECT "locations".* FROM "locations" INNER JOIN "locations_users" ON "locations"."id" = "locations_users"."location_id" WHERE "locations_users"."user_id" = $1  [["user_id", 1]]
---
  def index
    puts @current_user
    @locations = @current_user.locations.all

INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Seattle, WA, USA"], ["created_at", "2015-11-23 23:16:21.828880"], ["updated_at", "2015-11-23 23:16:21.828880"]]
INSERT INTO "favorites" ("categories", "title", "img", "vicinity", "place_id", "price_level", "rating", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
  	@current_user.locations.find_or_create_by location_params # works
  	@location = Location.find_by location_params
  	puts @location
  	@current_user.favorites << @location.favorites.create(place_params) # works

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."place_id" IS NULL LIMIT 1  [["user_id", 5]]
---
  def destroy
    favorite = @current_user.favorites.find(params[:id])